export const source = {
    buttonsMale: [
        {
            name: 'Прическа',
            trigger: 'setHairstyle'
        },
        {
            name: 'Цвет волос',
            trigger: 'setHairColor'
        },
        {
            name: 'Дополнительный цвет волос',
            trigger: 'setHairHighlightColor'
        },
        {
            name: 'Волосы на лице',
            trigger: 'setFacialHair'
        },
        {
            name: 'Цвет волос на лице',
            trigger: 'setFacialHairColor'
        },
        {
            name: 'Брови',
            trigger: 'setEyebrows'
        },
        {
            name: 'Высота бровей',
            trigger: 'setBrowHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Глубина бровей',
            trigger: 'setBrowDepth',
            left: 'Внутрь',
            right: 'Наружу'
        },
        {
            name: 'Цвет бровей',
            trigger: 'setEyebrowColor'
        },
        {
            name: 'Размер глаз',
            trigger: 'setEyeSize',
            left: 'Шире',
            right: 'Уже'
        },
        {
            name: 'Цвет глаз',
            trigger: 'setEyeColor'
        },
        {
            name: 'Глубина переносицы',
            trigger: 'setNoseBridgeDepth',
            left: 'Округлая',
            right: 'Впалая'
        },
        {
            name: 'Сдвиг переносицы',
            trigger: 'setNoseBroken',
            left: 'Левее',
            right: 'Правее'
        },
        {
            name: 'Высота расположения носа',
            trigger: 'setNoseBottomHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Ширина носа',
            trigger: 'setNoseWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Длина кончика носа',
            trigger: 'setNoseTipLength',
            left: 'Больше',
            right: 'Меньше'
        },
        {
            name: 'Высота кончика носа',
            trigger: 'setNoseTipHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Ширина скул',
            trigger: 'setCheekboneWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Глубина щек',
            trigger: 'setCheekDepth',
            left: 'Округлые',
            right: 'Впалые'
        },
        {
            name: 'Толщина губ',
            trigger: 'setLipThickness',
            left: 'Шире',
            right: 'Уже'
        },
        {
            name: 'Форма челюсти',
            trigger: 'setJawShape',
            left: 'Меньше',
            right: 'Больше'
        },
        {
            name: 'Ширина челюсти',
            trigger: 'setJawWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Высота подбородка',
            trigger: 'setChinHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Глубина подбородка',
            trigger: 'setChinDepth',
            left: 'Короткий',
            right: 'Длинный'
        },
        {
            name: 'Ширина подбородка',
            trigger: 'setChinWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Выступ подбородка',
            trigger: 'setChinIndent',
            left: 'Наружу',
            right: 'Внутрь'
        },
        {
            name: 'Ширина шеи',
            trigger: 'setNeckWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Дефекты кожи',
            trigger: 'setBlemishes'
        },
        {
            name: 'Старение кожи',
            trigger: 'setAgeing'
        },
        {
            name: 'Повреждение кожи',
            trigger: 'setSunDamage'
        },
        {
            name: 'Родинки и веснушки',
            trigger: 'setMolesFreckles'
        },
        {
            name: 'Волосы на теле',
            trigger: 'setChestHair'
        },
        {
            name: 'Цвет волос на теле',
            trigger: 'setChestHairColor'
        },
        {
            name: 'Назад'
        }
    ],

    buttonsFemale: [
        {
            name: 'Прическа',
            trigger: 'setHairstyle'
        },
        {
            name: 'Цвет волос',
            trigger: 'setHairColor'
        },
        {
            name: 'Дополнительный цвет волос',
            trigger: 'setHairHighlightColor'
        },
        {
            name: 'Брови',
            trigger: 'setEyebrows'
        },
        {
            name: 'Высота бровей',
            trigger: 'setBrowHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Глубина бровей',
            trigger: 'setBrowDepth',
            left: 'Внутрь',
            right: 'Наружу'
        },
        {
            name: 'Цвет бровей',
            trigger: 'setEyebrowColor'
        },
        {
            name: 'Размер глаз',
            trigger: 'setEyeSize',
            left: 'Шире',
            right: 'Уже'
        },
        {
            name: 'Цвет глаз',
            trigger: 'setEyeColor'
        },
        {
            name: 'Глубина переносицы',
            trigger: 'setNoseBridgeDepth',
            left: 'Округлая',
            right: 'Впалая'
        },
        {
            name: 'Сдвиг переносицы',
            trigger: 'setNoseBroken',
            left: 'Левее',
            right: 'Правее'
        },
        {
            name: 'Высота расположения носа',
            trigger: 'setNoseBottomHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Ширина носа',
            trigger: 'setNoseWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Длина кончика носа',
            trigger: 'setNoseTipLength',
            left: 'Больше',
            right: 'Меньше'
        },
        {
            name: 'Высота кончика носа',
            trigger: 'setNoseTipHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Ширина скул',
            trigger: 'setCheekboneWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Глубина щек',
            trigger: 'setCheekDepth',
            left: 'Округлые',
            right: 'Впалые'
        },
        {
            name: 'Толщина губ',
            trigger: 'setLipThickness',
            left: 'Шире',
            right: 'Уже'
        },
        {
            name: 'Помада',
            trigger: 'setLipstick'
        },
        {
            name: 'Цвет помады',
            trigger: 'setLipstickColor'
        },
        {
            name: 'Форма челюсти',
            trigger: 'setJawShape',
            left: 'Меньше',
            right: 'Больше'
        },
        {
            name: 'Ширина челюсти',
            trigger: 'setJawWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Высота подбородка',
            trigger: 'setChinHeight',
            left: 'Выше',
            right: 'Ниже'
        },
        {
            name: 'Глубина подбородка',
            trigger: 'setChinDepth',
            left: 'Короткий',
            right: 'Длинный'
        },
        {
            name: 'Ширина подбородка',
            trigger: 'setChinWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Выступ подбородка',
            trigger: 'setChinIndent',
            left: 'Наружу',
            right: 'Внутрь'
        },
        {
            name: 'Ширина шеи',
            trigger: 'setNeckWidth',
            left: 'Уже',
            right: 'Шире'
        },
        {
            name: 'Дефекты кожи',
            trigger: 'setBlemishes'
        },
        {
            name: 'Старение кожи',
            trigger: 'setAgeing'
        },
        {
            name: 'Повреждение кожи',
            trigger: 'setSunDamage'
        },
        {
            name: 'Родинки и веснушки',
            trigger: 'setMolesFreckles'
        },
        {
            name: 'Назад'
        }
    ],
    
    hairMale: [
        "Под ноль", "Коротко", "Ястреб", "Хипстер", "Челка набок", "Коротко", "Байкер", "Хвост", "Косички", "Прилиза",
        "Коротко", "Шипы", "Цезарь", "Чоппи", "Дреды", "Длинные", "Лохматый", "Серфингист", "Набок", 
        "Зализ", "Длинные", "Юный хипстер", "Муллет", "Косички", "Пальма", "Молния", "Уиппед", "Зиг-заг", "Снейл", "Хайтоп", "Откинутые", 
        "Андеркат", "Боковой андер", "Колючий ирокез", "Мод", "Слоями", "Флэттоп", "Армеец"
    ],
    hairFemale: [
        "Под ноль", "Коротко", "Слои", "Косички", "Хвост", "Ирокез", "Косички", "Боб", "Ястреб", "Ракушка",
        "Лонг боб", "Свободно", "Пикси", "Бритые виски", "Узел", "Волнистый боб", "Красотка", "Пучок", "Тугой узел", 
        "Твистед боб", "Флэппер боб", "Биг бэнгс", "Плетеные", "Муллет", "Косички", "Листья", "Зиг-заг", 
        "Пигтейл бэнгс", "Волнистые", "Катушка", "Завеса", "Откинутые", "Андеркат", 
        "Боковой андер", "Колючий ирокез", "Бандана", "Слоями", "Скинберд", "Аккуратные", "Шорт боб"
    ],

    colorHair: [
        "#211f1c", "#55362f", "#4b382e", "#4d291b", 
        "#70351e", "#904422", "#a55c36", "#a56944", 
        "#ac744f", "#ae7d57", "#be9161", "#cda670", 
        "#c8a370", "#d5a861", "#e0b775", "#e8c487", 
        "#b78457", "#a85d3d", "#963523", "#7c1411", 
        "#921812", "#a81c14", "#cb371e", "#de411b", 
        "#be532f", "#d34d21", "#907867", "#a78e7a", 
        "#d4bda9", "#e4cfbe"
    ],

    colorLip: [
        "#211f1c", "#55362f", "#4b382e", "#4d291b", 
        "#70351e", "#904422", "#a55c36", "#a56944", 
        "#ac744f", "#ae7d57", "#be9161", "#cda670", 
        "#c8a370", "#d5a861", "#e0b775", "#e8c487", 
        "#b78457", "#a85d3d", "#963523", "#7c1411", 
        "#921812", "#a81c14", "#cb371e", "#de411b", 
        "#be532f", "#d34d21", "#907867", "#a78e7a", 
        "#d4bda9", "#e4cfbe", "#775262", "#8f5973", 
        "#ad4a6b", "#f845cc", "#fc5794", "#f9a1b2", 
        "#09a497", "#08828e", "#084e7c", "#63a15a", 
        "#379665", "#25705d", "#bec22f", "#9ab516", 
        "#61a526", "#e8bd56", "#f2c20e", "#f2980e", 
        "#fc8b14", "#f76415", "#fe771c", "#f1501f", 
        "#ef3c17", "#c81414", "#9b0a0e", "#291a14", 
        "#3f241c", "#502c1e", "#47271d", "#4d2c1f", 
        "#39251c", "#080a0e", "#ad8d67", "#c59762"
    ],

    skinColors: [
        '#e0c2aa', '#804e40', '#a1765a', '#ebad69', '#cb7d50', '#c47f5b'
    ],

    skinIds: [
        0, 2, 4, 6, 8, 10
    ],

    eyeColors: ["#50c878", "#008000", "#add8e6", "#0077be", "#b5651d", "#654321", "#d0c383", "#a9a9a9"],
    
    blemishes: ["Нет", "Корь", "Прыщи", "Пятна", "Сыпь", "Угри", "Налет", "Пустулы", "Прыщики", "Тяжелое акне", "Акне", "Сыпь на щеках", "Сыпь на лице", "Шрамы", "Пубертат", "Язва", "Сыпь на подбородке", "Два лица", "Зона Т", "Сальный", "Крапленый", "Следы акне", "Большие   шрамы", "Герпес", "Лишай"],
        // facial hair
        facialHair: ["Нет", "Легкая щетина", "Бальбоа", "Круглая борода", "Эспаньолка", "Козлиная бородка", "Островок", "Тонкая бородка", "Неряха", "Мушкетер", "Усы", "Ухоженная борода", "Щетина", "Тонкая бородка", "Подкова", "Карандаш", "Ремень", "Бальбо и баки", "Баки", "Неряшливая борода", "Дали", "Дали и борода", "Руль", "Фауст", "Англичанин", "Голливуд", "Фу Манчу", "Островок с баками", "Широкие баки", "Ширма"],
        // eyebrows
        eyebrows: ["Нет", "Аккуратные", "Модные", "Клеопатра", "Ироничные", "Женственные", "Обольстительные", "Нахмуренные", "Чикса", "Триумф", "Беззаботные", "Дугой", "Мышка", "Двойная высечка", "Впалые", "Карандаш", "Выщипанные", "Прямые", "Естественные", "Пышные", "Неопрятные", "Широкие", "Обычные", "Южноевропейские", "Ухоженные", "Кустистые", "Перышки", "Колючки", "Монобровь", "Крылатые", "Тройная высечка", "Высечка дугой", "Подрезанные", "Сходящие на нет", "Высечка"],
        // ageing
        ageing: ["Нет", "Вороньи лапки", "Первые признаки", "Средний возраст", "Признаки старения", "Депрессия", "Преклонный возраст", "Старость", "Обветренная кожа", "Морщинистая кожа", "Обвислая кожа", "Тяжелая жизнь", "Винтаж", "Пенсионер", "Наркоман", "Старик"],
        // makeup
        makeup: ["Нет", "Дымчатый", "Бронзовый", "Серый", "Ретро глэм", "Естественный", "Кошка", "Чикса", "Вампир", "Гламур", "Баблгам", "Аква", "Пин ап", "Страсть", "Дымная кошка", "Рубин", "Поп принцесса"],
        // blush
        blush: ["Нет", "Полный", "Угловатый", "Круглый", "Горизонтальный", "Высокий", "Крошка", "Восьмидесятые"],
        // complexion
        complexion: ["Нет", "Румянец", "Раздражение", "Покраснение", "Ожог", "Синяки", "Алкоголик", "Пятна", "Тотем", "Сосуды", "Повреждения", "Бледная", "Мертвец"],
        // sun damage
        sunDamage: ["Нет", "Неровная", "Наждак", "Пятнистая", "Грубая", "Жесткая", "Шероховатая", "Загрубелая", "Неровная", "Со складками", "Потрескавшаяся", "Твердая"],
        // lipstick
        lipstick: ["Нет", "Цветная матовая", "Цветной блеск", "Матовая линия", "Блестящая линия", "Сильная матовая", "Сильный блеск", "Голая матовая", "Голый блеск", "Нечеткая", "Гейша"],
        // freckles
        freckles: ["Нет", "Ангел", "Повсюду", "Местами", "Единичные", "Переносица", "Куколка", "Фея", "Загорелая", "Родинки", "Ряд", "Модель", "Случайность", "Родинки", "Дождик", "Удвоенность", "Одна сторона", "Пары", "Бородавки"],
        // chest hair
        chestHair: ["Нет", "Естественные", "Полоса", "Дерево", "Волосатый", "Гризли", "Горилла", "Бритая горилла", "Бикини", "Удар молнии", "Обратная молния", "Сердце", "Боль в груди", "Счастливчик", "Череп", "Улитка", "Слизень", "Волосатые руки"],



    heredity: [
        {
            name: 'Мать',
            trigger: 'setMother'
        },
        {
            name: 'Отец',
            trigger: 'setFather'
        },
        {
            name: 'Сходство',
            trigger: 'setSimilarity'
        },
        {
            name: 'Цвет кожи',
            trigger: 'setSkin'
        },
        {
            name: 'Назад'
        },
        
    ]


}

export const fatherNames = ["Бенджамин", "Дэниэл", "Джошуа", "Ной", "Эндрю", "Хуан", "Алекс", "Айзек", "Эван", "Итан", "Винсент", "Энджел", "Диего", "Адриан", "Габриэль", "Майкл", "Сантьяго", "Кевин", "Луи", "Сэмюэль", "Энтони", "Клод", "Нико", "Джон"];
export const motherNames = ["Ханна", "Обри", "Жасмин", "Жизель", "Амелия", "Изабелла", "Зоуи", "Ава", "Камила", "Вайолет", "София", "Эвелин", "Николь", "Эшли", "Грейси", "Брианна", "Натали", "Оливия", "Элизабет", "Шарлотта", "Эмма", "Мисти"];


export const fathers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 42, 43, 44];
export const mothers = [21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 45];

export var indexes = []

export var refs = []

export var starts = []

export var values = []

export var arrays = []

export var colors = []

export var inds = []

export var arrs = []

export var cols = []

export var refCols = []

export var startSkin = []

export var indexesFemale = []

export var indexesMale = []

export var genderUser = ['Мужской']

export var help = [true]